---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Analysis.AnalysisDisplayLegend
source: html/63c30812-48bb-554a-1c7e-ef6274a41665.htm
---
# AnalysisDisplayLegend Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.